# Week 5 Pandas
Pandas is an important library in Machine Learning. It is used to access your data and do data cleaning and exploration of your data set.  We will start with the a sequence data type called series.

```
import pandas as pd
series_obj = pd.Series([10, 20, 30, 40, 50])
series_obj
```

In [62]:
import pandas as pd
series_obj = pd.Series([10, 20, 30, 40, 50])
series_obj

0    10
1    20
2    30
3    40
4    50
dtype: int64

# Accessing elements in the Series

```
series_obj[i]
# where i is the element index starting at 0
```

In [63]:
series_obj[0]

np.int64(10)

In [64]:
# Element-wise operations
series_ages = pd.Series([31, 22, 43, 44, 55])
series_ages

0    31
1    22
2    43
3    44
4    55
dtype: int64

# Arithmetic operations with Series
Series like np.arrays perform arithmetic operations.  
```
series_ages ** 2  # raise to 2nd power
series_ages * 4   # multiply by 4
series_ages / 6   # divide by 6
series_ages + 15  # add 15
series_ages - 13  # subtract 13
```

In [65]:
series_ages ** 2  # raise to 2nd power

0     961
1     484
2    1849
3    1936
4    3025
dtype: int64

In [66]:
series_ages * 4   # multiply by 4

0    124
1     88
2    172
3    176
4    220
dtype: int64

In [67]:
series_ages / 6   # divide by 6

0    5.166667
1    3.666667
2    7.166667
3    7.333333
4    9.166667
dtype: float64

In [68]:
series_ages + 15  # add 15

0    46
1    37
2    58
3    59
4    70
dtype: int64

In [69]:
series_ages - 13  # subtract 13

0    18
1     9
2    30
3    31
4    42
dtype: int64

# Boolean values

```
series_ages > 20
series_ages < 10
```

In [70]:
series_ages > 20

0    True
1    True
2    True
3    True
4    True
dtype: bool

In [71]:
series_ages < 35

0     True
1     True
2    False
3    False
4    False
dtype: bool

# From Dictionary to Dataframe
You learned to create a dictionary now we can use the dictionary to create a data set in Pandas called a dataframe.  Here is how you would do it.

```
import pandas as pd
data = {"Name" : ["Tim Miller", "Ann Carter", "Ellen Lee", "Sam Carr", "Al Ball", "Carl Bell", "Amy Haul"],
        "Gender" : ["Male", "Female", "Female", "Male", "Male", "Male", "Female"],
        "Age": [32, 44, 21, 19, 45, 27, 39]}
df = pd.DataFrame(data)
df
```

In [72]:
import pandas as pd
data = {"Name" : ["Tim Miller", "Ann Carter", "Ellen Lee", "Sam Carr", "Al Ball", "Carl Bell", "Amy Haul"],
        "Gender" : ["Male", "Female", "Female", "Male", "Male", "Male", "Female"],
        "Age": [32, 44, 21, 19, 45, 27, 39]}
df = pd.DataFrame(data)
df

         Name  Gender  Age
0  Tim Miller    Male   32
1  Ann Carter  Female   44
2   Ellen Lee  Female   21
3    Sam Carr    Male   19
4     Al Ball    Male   45
5   Carl Bell    Male   27
6    Amy Haul  Female   39

# Selecting the last 5 rows
Similiar to list and arrays you can select a subset of the dataframe data. The following code selects the last five rows.
```
df[-5 : ]
df.tail(5)
df.tail()
```

In [73]:
df[-5 : ]

        Name  Gender  Age
2  Ellen Lee  Female   21
3   Sam Carr    Male   19
4    Al Ball    Male   45
5  Carl Bell    Male   27
6   Amy Haul  Female   39

In [74]:
df.tail(5)

        Name  Gender  Age
2  Ellen Lee  Female   21
3   Sam Carr    Male   19
4    Al Ball    Male   45
5  Carl Bell    Male   27
6   Amy Haul  Female   39

In [75]:
df.tail()

        Name  Gender  Age
2  Ellen Lee  Female   21
3   Sam Carr    Male   19
4    Al Ball    Male   45
5  Carl Bell    Male   27
6   Amy Haul  Female   39

# Select the first 5 records in the dataframe

```
df.head()
df[0 : 5]
```

In [76]:
df.head()

         Name  Gender  Age
0  Tim Miller    Male   32
1  Ann Carter  Female   44
2   Ellen Lee  Female   21
3    Sam Carr    Male   19
4     Al Ball    Male   45

In [77]:
df[0 : 5]

         Name  Gender  Age
0  Tim Miller    Male   32
1  Ann Carter  Female   44
2   Ellen Lee  Female   21
3    Sam Carr    Male   19
4     Al Ball    Male   45

# Select a column from the dataframe
When you select a column from the dataframe it becomes a Panda Series.
```    
df['Name']
df.Name
```

In [78]:
df['Name']

0    Tim Miller
1    Ann Carter
2     Ellen Lee
3      Sam Carr
4       Al Ball
5     Carl Bell
6      Amy Haul
Name: Name, dtype: object

In [79]:
df.Name

0    Tim Miller
1    Ann Carter
2     Ellen Lee
3      Sam Carr
4       Al Ball
5     Carl Bell
6      Amy Haul
Name: Name, dtype: object

# Creating a data frame from an array
You can use the np.arange function to create an array of values from 0 to 99 and then reshape it to a 10 by 10 matrix.  You can use the columns command within the pandas dataframe to create the column names.
```
import pandas as pd
import numpy as np
data = pd.DataFrame(np.arange(100).reshape(10, 10), columns = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
data
```

In [80]:
data = pd.DataFrame(np.arange(100).reshape(10, 10), columns = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
data

    a   b   c   d   e   f   g   h   i   j
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [81]:
data['a']

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
Name: a, dtype: int64

# select multiple columns

```
data[['column1', 'column2',...]]
data[['a', 'e', 'j']]
```

In [82]:
data[['a', 'e', 'j']]

    a   e   j
0   0   4   9
1  10  14  19
2  20  24  29
3  30  34  39
4  40  44  49
5  50  54  59
6  60  64  69
7  70  74  79
8  80  84  89
9  90  94  99

# selecting rows
You may want to select another of rows.  To select a number of different rows use the following command.
```
data[5 : 9] # select rows 5 through 9
data[ : 1]  # select the first row
data[ : 2]  # select rows 0 and 1
```

In [83]:
data[ : 2]

    a   b   c   d   e   f   g   h   i   j
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19

In [84]:
data[5 : 9]

    a   b   c   d   e   f   g   h   i   j
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89

# Boolean values
You may want to know which values are strings are specific value.
```
data["j"] > 40
```

In [85]:
data["j"]

0     9
1    19
2    29
3    39
4    49
5    59
6    69
7    79
8    89
9    99
Name: j, dtype: int64

In [86]:
data["j"] > 40

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7     True
8     True
9     True
Name: j, dtype: bool

In [87]:
data[data["a"] > 25]  # select rows where "a" column has values greater than 25.

    a   b   c   d   e   f   g   h   i   j
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

# Row and Column selection with loc
Allows you to select a subset of the rows and columns using the label/name of the row/column.  In the index for others the end does not include that number.  But for loc it does.
```
data.loc[ : 5, "b"]  #first 5 rows of column "b"
```

In [88]:
data.loc[ : 5, "b"]  #first 5 rows of column "b"

0     1
1    11
2    21
3    31
4    41
5    51
Name: b, dtype: int64

In [89]:
data.loc[6: , 'a' : 'e']  # start at 6 and go to the end of columns a through e

    a   b   c   d   e
6  60  61  62  63  64
7  70  71  72  73  74
8  80  81  82  83  84
9  90  91  92  93  94

In [90]:
data.loc[2 : 6, ['c', 'f', 'i']]  # of list of columns rows 2 to 6

    c   f   i
2  22  25  28
3  32  35  38
4  42  45  48
5  52  55  58
6  62  65  68

# iloc select rows and columns by index numbers
```
data.iloc[2 : 6, [2, 5, 8]] #It selects rows 2 through n6 and columns 2, 5, and 8.
data.iloc[:, -1] # all rows last column
data.iloc[[5, 0, 3], [9, 5, 0]] # return row 5 0 3 and columns 9 5 and 0 in that order.
```

In [91]:
data.iloc[2 : 6, [2, 5, 8]] #It selects rows 2 through n6 and columns 2, 5, and 8.

    c   f   i
2  22  25  28
3  32  35  38
4  42  45  48
5  52  55  58

In [92]:
data.iloc[:, -1] # all rows last column

0     9
1    19
2    29
3    39
4    49
5    59
6    69
7    79
8    89
9    99
Name: j, dtype: int64

In [93]:
data.iloc[[5, 0, 3], [9, 5, 0]] # return row 5 0 3 and columns 9 5 and 0 in that order.

    j   f   a
5  59  55  50
0   9   5   0
3  39  35  30

# Reading in data from a file
You can use pandas to read in data from a file.  The majority of the time we will use a csv fil; however, you can use Excel, tsv, json, and csv files.  
# Read Excel file
```
import pandas as pd
df = pd.read_excel("iris.xlsx")
df
```

In [94]:
import pandas as pd
df = pd.read_excel("iris.xlsx")
df

     s_len   s_width   p_len   p_width           class
0      5.1       3.5     1.4       0.2     Iris-setosa
1      4.9       3.0     1.4       0.2     Iris-setosa
2      4.7       3.2     1.3       0.2     Iris-setosa
3      4.6       3.1     1.5       0.2     Iris-setosa
4      5.0       3.6     1.4       0.2     Iris-setosa
..     ...       ...     ...       ...             ...
145    6.7       3.0     5.2       2.3  Iris-virginica
146    6.3       2.5     5.0       1.9  Iris-virginica
147    6.5       3.0     5.2       2.0  Iris-virginica
148    6.2       3.4     5.4       2.3  Iris-virginica
149    5.9       3.0     5.1       1.8  Iris-virginica

[150 rows x 5 columns]

# Read in json file

```
import pandas as pd
js_df = pd.read_json("iris.json")
js_df
```

In [95]:
import pandas as pd
js_df = pd.read_json("irsjson.json")
js_df

     s_len  s_width  p_len  p_width           class
0      5.1      3.5    1.4      0.2     Iris-setosa
1      4.9      3.0    1.4      0.2     Iris-setosa
2      4.7      3.2    1.3      0.2     Iris-setosa
3      4.6      3.1    1.5      0.2     Iris-setosa
4      5.0      3.6    1.4      0.2     Iris-setosa
..     ...      ...    ...      ...             ...
145    6.7      3.0    5.2      2.3  Iris-virginica
146    6.3      2.5    5.0      1.9  Iris-virginica
147    6.5      3.0    5.2      2.0  Iris-virginica
148    6.2      3.4    5.4      2.3  Iris-virginica
149    5.9      3.0    5.1      1.8  Iris-virginica

[150 rows x 5 columns]

# Read csv file

```
import pandas as pd
csv_df = pd.read_csv("iris.csv")
csv_df.head()
```

In [96]:
import pandas as pd
csv_df = pd.read_csv("iris.csv")
csv_df.head()

   s_len   s_width   p_len   p_width        class
0    5.1       3.5     1.4       0.2  Iris-setosa
1    4.9       3.0     1.4       0.2  Iris-setosa
2    4.7       3.2     1.3       0.2  Iris-setosa
3    4.6       3.1     1.5       0.2  Iris-setosa
4    5.0       3.6     1.4       0.2  Iris-setosa

# Read tsv file

```
import pandas as pd
tsv_df = pd.read_csv('iris.tsv', sep="\t")
tsv_df.head()
```

In [97]:
import pandas as pd
tsv_df = pd.read_csv('iris.tsv', sep="\t")
tsv_df.head()

   s_len   s_width   p_len   p_width        class
0    5.1       3.5     1.4       0.2  Iris-setosa
1    4.9       3.0     1.4       0.2  Iris-setosa
2    4.7       3.2     1.3       0.2  Iris-setosa
3    4.6       3.1     1.5       0.2  Iris-setosa
4    5.0       3.6     1.4       0.2  Iris-setosa

# column names
You should check the column names to make sure your code will work on the column names.
```
tsv_df.columns
```

In [126]:
tsv_df.columns

Index(['s_len', ' s_width', ' p_len', ' p_width', 'class'], dtype='object')

In [ ]:
# rename the column names
Sometimes the column name is not what you want.  When that occurs, we use the rename command.  You must also include inplace = True to change that dataframe and not make a copy of the dataframe
```
tsv_df.rename(columns = {" s_width" : "s_width", " p_len" : "p_len", " p_width" : "p_width"}, inplace = True)
tsv_df.columns
```

In [129]:
tsv_df.rename(columns = {" s_width" : "s_width", " p_len" : "p_len", " p_width" : "p_width"}, inplace = True)
tsv_df.columns

Index(['s_len', 's_width', 'p_len', 'p_width', 'class'], dtype='object')

# Count method 
You may want to determine count the number of records that fit a specific category.  To do this, you can use the count number in the column
```
tsv_df['class'].count().item()  # scalar value number of records in 
tsv_df["class"].value_counts()  # count of unique values inm the columm

```

In [98]:
tsv_df['class'].count().item()

150

In [100]:
tsv_df["class"].value_counts()

class
Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: count, dtype: int64

# Information about a specific class

```
tsv_df .loc[tsv_df["class"].isin(["Iris-setosa"]), "s_len"]
```

In [135]:
tsv_df .loc[tsv_df["class"].isin(["Iris-setosa"]), "s_len"]

0     5.1
1     4.9
2     4.7
3     4.6
4     5.0
5     5.4
6     4.6
7     5.0
8     4.4
9     4.9
10    5.4
11    4.8
12    4.8
13    4.3
14    5.8
15    5.7
16    5.4
17    5.1
18    5.7
19    5.1
20    5.4
21    5.1
22    4.6
23    5.1
24    4.8
25    5.0
26    5.0
27    5.2
28    5.2
29    4.7
30    4.8
31    5.4
32    5.2
33    5.5
34    4.9
35    5.0
36    5.5
37    4.9
38    4.4
39    5.1
40    5.0
41    4.5
42    4.4
43    5.0
44    5.1
45    4.8
46    5.1
47    4.6
48    5.3
49    5.0
Name: s_len, dtype: float64

# Useful Methods to use with dataframe
```
df['column'].mode().item()   # scalar value
df['column'].median().item()  # scalar value
df['column'].sum().item() # scalar value
df['column'].count().item()  # scalar value
df['column'].value_counts() # scalar value
```
The methods above can be used with conditional statements so the following.

```
df.loc[df["column"] > value]["column interested in"].method().item()
df.loc[df["column"].isin([list of values or strings]), "column method applied").method().item()  # item makes the value a scalar
df.loc[(df["column"] > n) & (df["column"] > m), "column to apply method").method().item()
```
The operations can >, >=, <, <=, == <br>
To combine operations you can use & - and also || - or

In [144]:
tsv_df["s_len"].mode().item()

5.0

In [145]:
tsv_df["s_width"].median().item()

3.0

In [146]:
tsv_df["p_len"].sum().item()

563.8

In [147]:
tsv_df["p_width"].count().item()

150

In [149]:
tsv_df["class"].value_counts()

class
Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: count, dtype: int64

In [154]:
tsv_df[(tsv_df["s_len"] > 4.5)]["s_len"].mean().item()

5.893103448275862

In [159]:
tsv_df.loc[tsv_df["class"].isin(["Iris-setosa"]), "s_len"].mean().item()

5.006

In [161]:
tsv_df.loc[(tsv_df["s_len"] > 3.5) & (tsv_df["s_width"] < 3.5), "p_len"].mean().item()

4.078571428571428